app/controllers/task_controller.rb

    task = current_user.tasks.create({ name: name, due_date: due_date })
---
INSERT INTO "tasks" ("created_at", "due_date", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-15 12:01:44.511221"], ["due_date", "2014-11-20 22:33:44.000000"], ["name", "First Task"], ["updated_at", "2014-11-15 12:01:44.511221"], ["user_id", 3]]

    task = Task.find_by(id: id, user_id: current_user.id)
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = 1 AND "tasks"."user_id" = 3 LIMIT 1

    task = Task.find_by(id: id, user_id: current_user.id)
    return die 'Task not found' if task.nil?
    Task.update(task.id, name: name, due_date: due_date)
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = 4 AND "tasks"."user_id" = 3 LIMIT 1
UPDATE "tasks" SET "due_date" = ?, "updated_at" = ? WHERE "tasks"."id" = 4  [["due_date", "2014-11-20 22:34:44.000000"], ["updated_at", "2014-11-15 12:20:44.050299"]]

    task = Task.find_by(id: id, user_id: current_user.id)
    return die 'Task not found' if task.nil?
    task.delete
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = 6 AND "tasks"."user_id" = 3 LIMIT 1
DELETE FROM "tasks" WHERE "tasks"."id" = 6